{
  "title": "Heat & Temperature",
  "publicationStatus": "draft",
  "subtitle": "Computer Simulation: A Visual Approach to Learning the Invisible",
  "about": "The change of thermal energy, or heat, Q in an object when its\ntemperature changes from T<sub>1</sub> to T<sub>2</sub> is\n\nQ=ρVc(T<sub>2</sub>-T<sub>1</sub>)\n{: .formula}\n\nwhere *ρ* is the density, *V* is the volume, and *c* is the specific\nheat.\n\nImagine an object is placed into a completely insulated box filled with\nwater (see the image below). The initial temperatures of the object and\nthe water may be different. The water will either warm up or cool down\nthrough the diffusion of thermal energy. The direction of heat diffusion\ndepends on the difference of the initial temperatures. Two physical laws\ndictate that the following things must happen:\n\nThe thermal energy that flows into or out of the water in the box is:\n\nQ<sub>wat</sub>=ρ<sub>wat</sub>V<sub>wat</sub>c<sub>wat</sub>(T<sub>final</sub>-T<sub>wat</sub>)\n{: .formula}\n\nThe thermal energy that out of or into the object is:\n\nQ<sub>obj</sub>=ρ<sub>obj</sub>V<sub>obj</sub>c<sub>obj</sub>(T<sub>final</sub>-T<sub>obj</sub>)\n{: .formula}\n\nThe Law of Conservation of Energy requires that\nQ<sub>wat</sub>+Q<sub>obj</sub>=0. This allows us to determine that the\nfinal temperature must be:\n\nT<sub>final</sub>=\n(ρ<sub>wat</sub>V<sub>wat</sub>c<sub>wat</sub>T<sub>wat</sub>+ρ<sub>obj</sub>V<sub>obj</sub>c<sub>obj</sub>T<sub>obj</sub>)/\n(ρ<sub>wat</sub>V<sub>wat</sub>c<sub>wat</sub>+ρ<sub>obj</sub>V<sub>obj</sub>c<sub>obj</sub>)\n{: .formula}\n\nComputer modeling provides opportunities of virtual experimentation,\nwhich could make the understanding of the above concepts more concrete.\nThe model below presents a dynamic view of how heat transfer actually\nhappens between the test piece and the water, as opposed to just\nproviding a value of final temperature.\n\nIn the model, there are two thermometers for monitoring the temperatures\ninside and outside the test piece. While the model is running, you can\nturn a graph on to view the temperatures recorded by the thermometers.\nThe following things can be explored with this model (remember to reset\nthe simulation using the \\\"Reset\\\" button before you change the model):\n\n",
  "importedFrom": "imports/energy2d/content/ht.html",
  "models": [
    {
      "type": "energy2d",
      "id": "ht1",
      "url": "imports/energy2d/models-json/ht1.json",
      "importedFrom": "imports/energy2d/models-xml/ht1.e2d",
      "viewOptions": {
        "controlButtons": "play_reset"
      }
    }
  ],
  "components": [

  ]
}