{
  "model": "/imports/energy2d/models-json/ht1.json",
  "components": [
    {
      "type": "energy2d-simulation-player",
      "id": "energy2d-player-id"
    },
    {
      "type": "energy2d-scene-view",
      "id": "energy2d-scene-id"
    }
  ],
  "description": {
    "title": "Heat & Temperature",
    "tagline": "A Visual Approach to Learning the Invisible",
    "content": "The change of thermal energy, or heat, Q in an object when its temperature increases from T1 to T2 is\n\nQ=ρVc(T2-T1)where ρ is the density, V is the volume (the area in the case of a two-dimensional model), and c is the specific heat.\n \nImagine an object is placed into a completely insulated box (see the image below). The initial temperatures of the object and the box may be different. \nThe box will either warm up or cool down through the diffusion of thermal energy. The direction of\nheat diffusion depends on the difference of the initial temperatures. Two physical laws dictate that the following things must happen:\n\nThe thermal energy that flows into or out of the environment in the box is:\n\nQenv=ρenvVenvcenv(Tfinal-Tenv)The thermal energy that out of or into the object is:\n\nQobj=ρobjVobjcobj(Tfinal-Tobj)The Law of Conservation of Energy requires that Qenv+Qobj=0. \nThis allows us to determine that the final temperature must be:\n\nTfinal=\n(ρenvVenvcenvTenv+ρobjVobjcobjTobj)/\n(ρenvVenvcenv+ρobjVobjcobj)\n\nComputer modeling provides opportunities of virtual experimentation, \nwhich could make the understanding of the above concepts more concrete. \nThe model below presents a dynamic view of how heat transfer actually happens between\nthe test piece and the environment, as opposed to just providing a value of final temperature.\n\nIn the model, there are two thermometers for monitoring the temperatures inside \nand outside the test piece. While the model is running, you can turn a graph on to view the temperatures \nrecorded by the thermometers. The following things can be explored with this model (remember to reset the simulation\nusing the \"Reset\" button before you change the model):",
    "footnote": ""
  },
  "layout": {
    "energy2d-scene-id": {
      "css": {
        "width": "600px",
        "height": "600px"
      }
    },
    "energy2d-player-id": {
      "class": "component_group",
      "css": {
        "text-align": "center",
        "margin": "0.2em"
      }
    }
  }
}